
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/tooruuetani/gh-actions-test/actions/runs/8683670080)



<pre><code>Apply complete! Resources: 2 added, 0 changed, 1 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
data.aws_caller_identity.current: Reading...
data.aws_region.now: Reading...
aws_cloudfront_origin_access_identity.main: Refreshing state... [id=E25PBB9YQFIAQA]
aws_ecr_repository.main: Refreshing state... [id=gha-test-account-lambda]
data.aws_region.now: Read complete after 0s [id=ap-northeast-1]
aws_s3_bucket.main: Refreshing state... [id=cloudfornt-origin-for-gha-test-dev]
data.aws_caller_identity.current: Read complete after 0s [id=082954585471]
aws_iam_role.main: Refreshing state... [id=gha-test-lambda-role-dev]
null_resource.generate_dummy_image: Refreshing state... [id=40639623560802867]
aws_s3_bucket_policy.main: Refreshing state... [id=cloudfornt-origin-for-gha-test-dev]
aws_s3_bucket_ownership_controls.main: Refreshing state... [id=cloudfornt-origin-for-gha-test-dev]
aws_cloudfront_distribution.main: Refreshing state... [id=E328DBI9XYI9DJ]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_lambda_function.main will be created
  + resource "aws_lambda_function" "main" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + function_name                  = "gha-test-lambda-dev"
      + id                             = (known after apply)
      + image_uri                      = "082954585471.dkr.ecr.ap-northeast-1.amazonaws.com/gha-test-account-lambda:dev"
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::082954585471:role/gha-test-lambda-role-dev"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + image_config {
          + command = [
              + "handler.lambda_handler",
            ]
        }
    }

  # null_resource.generate_dummy_image is tainted, so must be replaced
-/+ resource "null_resource" "generate_dummy_image" {
      ~ id       = "40639623560802867" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 2 to add, 0 to change, 1 to destroy.
null_resource.generate_dummy_image: Destroying... [id=40639623560802867]
null_resource.generate_dummy_image: Destruction complete after 0s
null_resource.generate_dummy_image: Creating...
null_resource.generate_dummy_image: Provisioning with 'local-exec'...
null_resource.generate_dummy_image (local-exec): Executing: ["/bin/sh" "-c" "aws ecr get-login-password --region ap-northeast-1 | docker login --username AWS --password-stdin 082954585471.dkr.ecr.ap-northeast-1.amazonaws.com"]
aws_lambda_function.main: Creating...
aws_lambda_function.main: Creation complete after 7s [id=gha-test-lambda-dev]
null_resource.generate_dummy_image (local-exec): WARNING! Your password will be stored unencrypted in /home/runner/.docker/config.json.
null_resource.generate_dummy_image (local-exec): Configure a credential helper to remove this warning. See
null_resource.generate_dummy_image (local-exec): https://docs.docker.com/engine/reference/commandline/login/#credentials-store

null_resource.generate_dummy_image (local-exec): Login Succeeded
null_resource.generate_dummy_image: Provisioning with 'local-exec'...
null_resource.generate_dummy_image (local-exec): Executing: ["/bin/sh" "-c" "docker pull alpine:latest"]
null_resource.generate_dummy_image (local-exec): latest: Pulling from library/alpine
null_resource.generate_dummy_image (local-exec): 4abcf2066143: Already exists
null_resource.generate_dummy_image (local-exec): Digest: sha256:c5b1261d6d3e43071626931fc004f70149baeba2c8ec672bd4f27761f8e1ad6b
null_resource.generate_dummy_image (local-exec): Status: Downloaded newer image for alpine:latest
null_resource.generate_dummy_image (local-exec): docker.io/library/alpine:latest
null_resource.generate_dummy_image: Provisioning with 'local-exec'...
null_resource.generate_dummy_image (local-exec): Executing: ["/bin/sh" "-c" "docker tag alpine:latest 082954585471.dkr.ecr.ap-northeast-1.amazonaws.com/gha-test-account-lambda:dev"]
null_resource.generate_dummy_image: Provisioning with 'local-exec'...
null_resource.generate_dummy_image (local-exec): Executing: ["/bin/sh" "-c" "docker push 082954585471.dkr.ecr.ap-northeast-1.amazonaws.com/gha-test-account-lambda:dev"]
null_resource.generate_dummy_image (local-exec): The push refers to repository [082954585471.dkr.ecr.ap-northeast-1.amazonaws.com/gha-test-account-lambda]
null_resource.generate_dummy_image (local-exec): d4fc045c9e3a: Preparing
null_resource.generate_dummy_image (local-exec): d4fc045c9e3a: Layer already exists
null_resource.generate_dummy_image: Still creating... [10s elapsed]
null_resource.generate_dummy_image (local-exec): dev: digest: sha256:6457d53fb065d6f250e1504b9bc42d5b6c65941d57532c072d929dd0628977d0 size: 528
null_resource.generate_dummy_image: Creation complete after 11s [id=5887745334708876363]

Apply complete! Resources: 2 added, 0 changed, 1 destroyed.

Outputs:

cloudfront_bucket = "cloudfornt-origin-for-gha-test-dev"
cloudfront_id = "E328DBI9XYI9DJ"
lambda_name = "gha-test-lambda-dev"
lambda_role_arn = "arn:aws:iam::082954585471:role/gha-test-lambda-role-dev"
repository_name = "gha-test-account-lambda"
repository_url = "082954585471.dkr.ecr.ap-northeast-1.amazonaws.com/gha-test-account-lambda"

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"account_terraform_apply_dev","PRNumber":18,"Program":"tfcmt","SHA1":"b8d51a223368aaecc7f16482200e0d634f2b8f31","Vars":{},"WorkflowName":"common-merge"} -->